Hi folks 👋 This issue is resolved in Terraform 0.12, which supports rich data types as well as a fully featured `jsonencode()` function.

For example, given this configuration:

```hcl
terraform {
  required_providers {
    aws = "2.20.0"
  }
  required_version = "0.12.5"
}

provider "aws" {
  region = "us-east-1"
}

variable "container_port_mappings" {
  type = list(object({
    hostPort      = number
    containerPort = number
    protocol      = string
  }))
  default = [{
    hostPort      = 12345
    containerPort = 12345
    protocol      = "tcp"
  }]
}

resource "aws_ecs_task_definition" "test" {
  family = "test"

  container_definitions = jsonencode([
    {
      cpu          = 10
      essential    = true
      image        = "busybox"
      memory       = 128
      name         = "test"
      portMappings = var.container_port_mappings
    }
  ])
}
```

Produces the following apply output:

```
$ terraform apply

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_ecs_task_definition.test will be created
  + resource "aws_ecs_task_definition" "test" {
      + arn                   = (known after apply)
      + container_definitions = jsonencode(
            [
              + {
                  + cpu          = 10
                  + essential    = true
                  + image        = "busybox"
                  + memory       = 128
                  + name         = "test"
                  + portMappings = [
                      + {
                          + containerPort = 12345
                          + hostPort      = 12345
                          + protocol      = "tcp"
                        },
                    ]
                },
            ]
        )
      + family                = "test"
      + id                    = (known after apply)
      + network_mode          = (known after apply)
      + revision              = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

aws_ecs_task_definition.test: Creating...
aws_ecs_task_definition.test: Creation complete after 1s [id=test]

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.
```

Enjoy! 🚀